<?php


// ============== регистрируем виджет с меню ============== //
	register_nav_menu("menu", "Primary Menu");
    
// ============== регистрируем виджет с меню ============== //


// ============== регистрируем виджет слайдера ============== //

	$args = array("name" => "Слайдер верхний",
				  "id" => "slider_index",
				  "description" => "Добавьте слйдер через виджет Текст",
				  "before_widget" => "",
				  "after_widget" => ""
					);

	register_sidebar($args);

// ============== регистрируем виджет слайдера ============== //


// поддержка миниатюр в записях 
add_theme_support("post-thumbnails");


// ============== регистрируем виджет футера (иконки соц сетей) ============== //

	$args = array("name" => "Иконки соц сетей (футер)",
				  "id" => "social_footer",
				  "description" => "Добавьте иконки через виджет Текст",
				  "before_widget" => "",
				  "after_widget" => ""
					);

	register_sidebar($args);

// ============== регистрируем виджет футера (иконки соц сетей) ============== //

?>